{
  "deciding-what-button-to-add-to-my-site": {
    "attributes": {
      "title": "Deciding What Button To Add To My Site",
      "published_at": "2019-12-28T00:00:00.000Z",
      "description": "How I come up with new navigation button on my site"
    },
    "body": "I recently updated the buttons on my blogs. Creating the buttons weren't hard, but the process of deciding where they go, what they should look like, and what they should do is. Here I am going to share my design process. I hope to impart to you guys my design process thinking\n\n# Deciding what kind of User Experience I want to provide\n\nIt is good to have a goal for my readers. I came up with two:\n\n1. To provide minimal distraction so user can focus on page content.\n2. To provide ease navigating around so user can focus on page content\n\nI want a subtle helper that does not take away from the content. *Its main thing is to keep its main thing the main thing: the content.*\n\n\n# Current Design\n\nThis is the current site\n![Current site - it only has bulb](https://firebasestorage.googleapis.com/v0/b/archer-import.appspot.com/o/blogs%2F2019%2F12%2F28%2Firiancurrent.png?alt=media&token=389ba3aa-f7ba-42a4-a878-468aefb3180b)\n\nWhat is it lacking? I can come up with infinite list, but two stood out: button to go to previous page and button to scroll to top.\n\nThere are other features that I'd like to add like: bookmarks, highlights, note-taking, etc. Those might come later, but for MVP, I decided that the easiest, most important features are the ability to go back and scroll up.\n\n# Inspiration\n\nI started by researching other sites I think have good design for design problem I am facing. Here are some:\n\n[Exo docs](https://hexdocs.pm/exo/Exo.html)\n![exo docs screenshot](https://firebasestorage.googleapis.com/v0/b/archer-import.appspot.com/o/blogs%2F2019%2F12%2F28%2Finspiration-exo.png?alt=media&token=f2180129-f313-4984-9b80-bc5d8e846cd0)\n\n[Vue docs](https://vuejs.org/v2/guide/)\n![vue docs screenshot](https://firebasestorage.googleapis.com/v0/b/archer-import.appspot.com/o/blogs%2F2019%2F12%2F28%2Finspiration-vue.png?alt=media&token=3578d33b-3bbd-493e-9748-685922d396ff)\n\n[patdryburgh](https://patdryburgh.com/)\n![pat blog screenshot](https://firebasestorage.googleapis.com/v0/b/archer-import.appspot.com/o/blogs%2F2019%2F12%2F28%2Finspiration-pat.png?alt=media&token=088e6717-5985-4c70-8d08-197522542aaf)\n\n[xomisse](https://xomisse.com/blog/add-a-scroll-back-to-top-button-to-blogger/)\n![xomisse blog](https://firebasestorage.googleapis.com/v0/b/archer-import.appspot.com/o/blogs%2F2019%2F12%2F28%2Finspiration-xomisse.png?alt=media&token=c9bb772a-8108-494d-b303-9922340c8dd3)\n\n\nSome things that stood out:\n- I really liked xomisse's scrollTop button. It is minimalistic and not distracting. The only thing that can be improved is positioning. At the moment it overlaps some of the texts\n- I liked the hexdocs' implementation of left and right sidebars. They are unintrusive and yet very useful.\n- I also liked Pat's top right navs (dark mode and search). But for the time being, I am not implementing them - so I will keep that as a reference for later.\n\n# Synthesizing Ideas\n\nFrom inspirations, I decided on three things: dark-mode, back arrow, and scrollTop arrow. I also decided to put them in the bottom so they won't interfere with most people's [F-shaped reading pattern](https://www.nngroup.com/articles/f-shaped-pattern-reading-web-content-discovered/).\n\nThis is what I came up with. Note the two buttons on bottom left:\n\n![result with two sidebar arrows](https://firebasestorage.googleapis.com/v0/b/archer-import.appspot.com/o/blogs%2F2019%2F12%2F28%2Fresult-twoarrows.png?alt=media&token=e8f0e138-9dfa-4224-a94d-d4b8fc771fa3)\n\nI will skip the coding part here because my intention is to share design process, not coding process. I use [vuejs](https://vuejs.org/) for my frontend needs and it has been super awesome.\n\n# Attempt 2\n\nAfter letting it sit for a day, I decided to take the left arrow out.\n\nWhy, you ask?\n\nBecause my main goal is simplicity. The less there is on the screen, the more user can focus on content.\n\n1. Browsers have back button already. Why should I add another button to do same thing all major browsers already do?\n2. Adding extra button adds slight cognitive load to user. More cognitive load = less cognitive capacity for users to focus on articles.\n3. Slashing out one of the buttons actually added an element of symmetry. Now we are left with one button on each sides. Symmetry is good.\n\n# Final design\n\nThis is the final design.\n\n![Final result](https://firebasestorage.googleapis.com/v0/b/archer-import.appspot.com/o/blogs%2F2019%2F12%2F28%2Ffinalresult.png?alt=media&token=4bc35057-c590-427d-80f5-7bdac367b3a3)\n\nI think it accomplish what I intended to do in the beginning: to help user consume content with least distraction.\n",
    "frontmatter": "title: Deciding What Button To Add To My Site\npublished_at: 2019-12-28\ndescription: How I come up with new navigation button on my site"
  },
  "i-read-over-120-books-last-year-and-this-is-how-how-you-can-too,-even-if-you-are-very-busy": {
    "attributes": {
      "title": "I read over 120 books last year and this is how how you can too, even if you are very busy",
      "published_at": "2020-01-02T00:00:00.000Z",
      "description": "What I learned from reading over 120 books last year"
    },
    "body": "I read that Bill Gates read about [50 books a year](https://www.businessinsider.com/why-bill-gates-reads-50-books-a-year-2015-11). If one of the busiest men on earth can read 50 books, I can do it too! So I set a target in 2019 to read at least 50 books.\n\nI finished 2019 having read 123 books. For a list of books I read, you can find them on goodreads [here](https://www.goodreads.com/user/show/8348083-iggy).\n\nHere are 5 things I did to help me meet that goal. If you are not a reader but want to become one, believe me, by forming the right habits, anyone can do this. My hope is to encourage you that you can read more than 50 books each year even if you live a busy life.\n\n# Impose a daily reading limit.\n\nFirst, you need to set yourself a minimum amount of daily reading time that you absolutely cannot break. I decided that I would not go to sleep at night until I have read a book for 25 minutes per day. However, the number itself is arbitrary. I picked 25 because that's the standard time for [pomodoro timer](https://en.wikipedia.org/wiki/Pomodoro_Technique). Set a number that you are comfortable with. I suggest starting out with smaller number that you can follow consistently than starting too high and fail to keep up.\n\nThe important thing is, that limit must be followed daily no matter what. Ask your spouse, friend, or even a daily reminder on your phone to help you. Do not let a single day pass without you completing it. It does not have to be in one big continuous chunk either. You can do 5 minutes in the morning, 10 minutes at lunch, and 10 minutes before bed. I personally did 15 minutes after dinner and 10 minutes before bed.\n\nAlso, do not let the minutes to roll over. 25 minutes. Every. Day. If I read 3 hours one day, this does not mean I am excused for the rest of the week. I have to do another 25 minutes the next day.\n\nI admit the first 2 months was rough. I was struggling to meet daily quota. I remember one day I came home at 11 PM after a long day. After my wife slept, I sat inside the closet and read. You must push through it and do it. This is how habits are formed. Once it becomes a habit, it becomes much easier.\n\nIf you read at average rate of 1 page/ minute, 25 min/ year = 9125 pages. Assuming average books have 200-300 pages, That's at least 30-40 books/ year! Note that 25 is the minimum; I would end up reading for more than 25 minutes most days.\n\n# Have books in your phone\n\n[Scribd](https://www.scribd.com/) is my favorite app to do this. It is a book subsription app for only $8.99/ month! It's like netflix for books. Not only books, it also has a good selection of articles, podcasts, and audiobooks.\n\nI also have kindle in my phone and tablet. There are some books that are available only on Kindle and not on Scribd. I heard [overdrive](https://app.overdrive.com/) and [audible](https://www.audible.com/) are also good ones to have. About 75% of my reading last year was done on my phone/ tablet.\n\nWhenever I am waiting in line, waiting in car, waiting anywhere, I would pull out my phone and read. A minute here and there throughout the day adds up!\n\nA good trick is, whenever you find yourself waiting for prolonged time, instead of browsing instagram/ tiktok/ facebook/ snapchat, force yourself to read a book for 5 minutes, then reward yourself by going to your favorite social media app after.\n\n# Listen to audiobooks when you travelling\n\nI made a habit listening to audiobooks on my way to work. Thanks to Scribd, I always have access of audiobooks on my phone. It takes 20-30 minutes to commute to work. I set a minimum of 10 minutes listening to audiobooks. For my reward, I would listen to my favorite music.\n\nThis ensures that I listen to minimum of 20 minutes audiobooks every weekdays. On average, in a week, I listened to 100-150 minutes of audiobooks. This amounts to a third or even a whole book a week. I finished around 2 audiobooks each month (which is about 24 books per year, almost half of the reading quota!)\n\n#  Visit local libraries\n\nI live relatively near local library. If you live in a major city, chances are you probably have one nearby. I try to make an effort with my wife to visit it (plus our friend works there) at least once or twice a month. While we are there, we would stay for 1-2 hours. This forces me to read a good amount each visit. After visiting a library, you can reward yourself - go visit your favorite store afterwards!\n\nAlthough I read most of my books in digital format, nothing beats the feeling of physical book. Plus being a library book, I have to return it within 3 weeks. This forces me to finish a book within 3 weeks.\n\n# Reading before entertainment\n\nBefore me and my wife would watch shows or play games, we would spend some time reading for 15 minutes. Even 10 minutes goes a long way.\n\nThis goes with everthing else entertainment. Before we go to movies, exploring town, go to restaurant, have people over, etc, I would read something before. This makes entertainment even more rewarding.\n\nJust like water tastes better after a good physical workout, entertainment feels better after a good mental workout.\n\n# Conclusion\n\nIn [The Power of Habit](https://www.amazon.com/dp/B0055PGUYU/), Duhigg said that to make something into a habit, you need to have 3 things: a cue, a routine, and a reward. To make reading a book into a habit, you need those 3 as well. If you notice, there is always a reward after reading. My goal is to help you develop reading as a habit. Once it becomes a habit, it becomes easier to read everyday.\n\nOne of my cues is dinner: after dinner, I would try to read (routine) for about 15 minuts. For the reward, we would watch a show/ play PS4/ board games afterwards. Once this became a habit, it got a lot easier.\n\nBy reading 50 books/ year, in 10 years I would have read 500 books. In 40 years, it is over 2000 books. If however I read 100 books each year, in 10 years it becomes 1000 books, 40 years = 4000 books. I don't think I will ever go back and say, man, I wish I would hav read less books and watched more shows!\n\nSo there you have it folks. Thanks for making it this far. These are some things I did to read 120 books last year. This year, I plan to set the same goal (50 books). I just finished [Five cities that ruled the world](https://www.amazon.com/dp/B007FZSTI8/) book and [Primal Branding](https://www.amazon.com/dp/B000FCKRWY/) audiobook. I just picked up [ultralearning](https://www.scotthyoung.com/blog/ultralearning/) for my next reading. Maybe I will write about books I read soon.\n\nWhat are you currently reading this week?\n\n",
    "frontmatter": "title: I read over 120 books last year and this is how how you can too, even if you are very busy\npublished_at: 2020-01-02\ndescription: What I learned from reading over 120 books last year"
  },
  "how-to-conditionally-render-convertkit-on-vuejs": {
    "attributes": {
      "title": "How to conditionally render convertkit on vuejs",
      "published_at": "2019-12-31T00:00:00.000Z",
      "description": "How to render Convertkit only on select pages in SPA"
    },
    "body": "I started using [convertkit](https://convertkit.com/) for mailing list. It is an awesome service for creators to help them grow mailing list. I recently encountered a problem where I need my form to be displayed on all my blogs page, but not on my About page. My blog (at the time of this writing) uses VueJS, but this problem may occur on any Single Page App (SPA). I will explain how I fixed it.\n\nTLDR:\n1. ConvertKit form is being displayed on all pages in SPA apps\n2. Use navigation guard to programatically embed forms only on matching routes\n3. Use navigation guard to remove embedded code on routes where we don't want to display the guard\n\n# The issue\n\nThere are several ways to embed Convertkit into a page:\n1. Javascript\n2. HTML\n3. Share\n4. Wordpress\n5. Unbounce\n\nThe method that I use is method 1, Javascript. Using the embed script, I pasted it into my `public/index.html`. The problem is, it shows up everywhere, on every single page.\n\nI need it to show up on specific pages, mainly \"Blogs\" and \"Blog\" pages. I definitely do not need it on About page\n\n# The cause\n\nWhen I pasted the ConvertKit code to public directory, it is being displayed everywhere. Being SPA, everything actually lives inside `<div id=\"app\"></div>`.\n\nSo the embedded CK form lives outside my app. First, we need to move the embed INSIDE Vue app.\n\nThe problem is, I can't just drop `<script src=\"...\">` inside my Vue component. Vue components don't know what to do with script tag.\n\n# The fix\n\nFor my solution, I decided to use Vue navigation [guards](https://router.vuejs.org/guide/advanced/navigation-guards.html).\n\nHere is the code that I use (my project originally started using vue-cli. main.js is where Vue instance is mounted to `#app`. You can do it wherever you add `VueRouter` into your app.)\n\n```\n...\n// main.js\nconst router = new VueRouter(routes);\n\nrouter.beforeEach((to, from, next) => {\n  const ckScript = document.querySelector(\"script[src*=convertkit]\");\n  const ckForm = document.querySelector(\"form\");\n  if ((ckForm || ckScript) && (to.name === \"Blog\" || to.name === \"Blogs\")) {\n    next();\n  }\n\n  if (ckForm) document.body.removeChild(ckForm);\n  if (ckScript) document.body.removeChild(ckScript);\n\n  if (to.name === \"Blog\" || to.name === \"Blogs\") {\n    let ckEmbed = document.createElement(\"script\");\n    ckEmbed.setAttribute(\n      \"src\",\n      \"https://your-CK-url\"\n    );\n    ckEmbed.setAttribute(\"data-uid\", \"12345ABC\"); // your ConvertKit data-uid\n    ckEmbed.async = true;\n    document.body.appendChild(ckEmbed);\n  }\n  next();\n});\n```\n\nLet me explain the code above.\n\nAfter playing around with ConvertKit, I realized that the original embedded script adds 2 HTML elements: a script with `src=\"...convertkit\"` and a `form`. My strategy is to intercept the URL requests. If they are going to either Blog or Blogs, I need to add the ConvertKit JS script.\n\nFirst I want to make sure that whenever we go to new page, we look for those elements (`src=...convertkit` and `form`) and delete them. Doing this will remove the form from being displayed.\n\nThis will find the two elements and delete them if they exist:\n\n```\n  const ckScript = document.querySelector(\"script[src*=convertkit]\");\n  const ckForm = document.querySelector(\"form\");\n  ...\n  if (ckForm) document.body.removeChild(ckForm);\n  if (ckScript) document.body.removeChild(ckScript);\n```\n\nIf we are headed to Blog or Blogs, I don't want them to be deleted. I want them to be displayed.\n\n```\n  if ((ckForm || ckScript) && (to.name === \"Blog\" || to.name === \"Blogs\")) {\n    next();\n  }\n```\n\nWe need to embed the script the way ConvertKit wants us to. I used `createElement` DOM methods to add a new script src, and sets its attributes to whatever convertKit tells.\n```\n  if (to.name === \"Blog\" || to.name === \"Blogs\") {\n    let ckEmbed = document.createElement(\"script\");\n    ckEmbed.setAttribute(\n      \"src\",\n      \"https://your-CK-url\"\n    );\n    ckEmbed.setAttribute(\"data-uid\", \"12345ABC\"); // your ConvertKit data-uid\n    ckEmbed.async = true;\n    document.body.appendChild(ckEmbed);\n  }\n```\n\nBtw, you may notice the extra logic below in the if statement. For optimization, I don't want to remove and add ConvertKit script each time we go between blogs. If we going to different Blogs, we should leave the forms alone, so I added a logic to check if `ckForm` or `ckScript` exist. If they do AND if we are headed to either Blog or Blogs, we don't need to remove/ add anything.\n\n```\n  if ((ckForm || ckScript) && (to.name === \"Blog\" || to.name === \"Blogs\")) {\n    next();\n  }\n```\n\nYou can find the documentations here:\n- [`createElement`](https://developer.mozilla.org/en-US/docs/Web/API/Document/createElement)\n- [`setAttribute`](https://developer.mozilla.org/en-US/docs/Web/API/Element/setAttribute)\n- [`appendChild`](https://developer.mozilla.org/en-US/docs/Web/API/Node/appendChild)\n\nAs an additional optimization, I also added\n```\n  if (process.env.NODE_ENV === \"production\") {\n    ...\n  }\n```\n\nSo when I am on development environment, I won't have the convetkit page. This saves me some time from loading the form when I don't need it locally.\n\n# Conclusion\n\nI am happy with the result. I assume this approach would work with other SPA apps like React. I believe [React router](https://github.com/ReactTraining/react-router) has something similar. This [SO post](https://stackoverflow.com/questions/42253277/react-router-v4-how-to-get-current-route) might help. I am not too sure about Angular, but I assume most SPA framework would have similar capability.\n\nThanks for reading! Let me know if you notice an error. Have a great 2020!\n",
    "frontmatter": "title: How to conditionally render convertkit on vuejs\npublished_at: 2019-12-31\ndescription: How to render Convertkit only on select pages in SPA"
  }
}